[
    {
        "term":"Project",
        "description":"A project is a temporary, unique endeavor undertaken to create a specific product, service, or result. It has a defined start and end date, clear objectives, and requires coordination of resources, budget, and time. Projects are different from ongoing operations because they have a specific goal and conclude once that goal is achieved. Projects typically follow a lifecycle with phases like initiation, planning, execution, monitoring, and closure. Managing a project involves balancing competing constraints such as scope, time, cost, quality, risk, and resources. Success is measured by whether the project meets its objectives within these constraints."
    },
    {
        "term":"Program",
        "description":"A program is a collection of related projects managed in a coordinated manner to obtain benefits and control that would not be possible by managing the projects individually. Programs are not simply larger projects — they are strategic efforts where projects have shared objectives, resources, stakeholders, or dependencies. Programs focus on delivering business value rather than individual project deliverables. Programs allow for centralized management of risks, schedules, costs, and resources across multiple projects, ensuring that the projects align to achieve a higher-level organizational goal. They often bridge the gap between corporate strategy and operational project work, aligning all projects within the program to a common business objective."
    },
    {
        "term":"Portfolio",
        "description":"A portfolio refers to the entire collection of projects, programs, and operational work that an organization manages to achieve its strategic objectives. Portfolios are not just random collections — they are aligned with the organization’s overarching strategy, ensuring that every project and program contributes to the big-picture goals of the business. Portfolio management focuses on prioritizing investments (projects and programs) based on their value, risk, cost, resource availability, and strategic alignment. This helps senior management decide which projects to approve, pause, or stop. Portfolios are continuously reviewed to ensure the organization’s investments remain relevant as business priorities evolve."
    },
    {
        "term":"Project Scope",
        "description":"Project Scope refers to the detailed definition of what the project will deliver — and equally important — what it won’t deliver. It defines all the work required to create the final product, service, or result. Defining scope clearly at the beginning ensures everyone understands the boundaries of the project, including its deliverables, exclusions, constraints, and assumptions. The scope statement becomes a critical reference point for the project team and stakeholders throughout the project lifecycle. Poorly defined scope (or no scope) often leads to scope creep, where new tasks are added without proper review and approval, causing delays, cost overruns, and quality issues.\n \n Scope is normally documented in two forms:\n \n Product Scope – Focuses on the features and functions of the product or service being delivered.\n Project Scope – Focuses on the work required to deliver the product."
    },
    {
        "term":"Scope Creep",
        "description":"Scope Creep refers to the uncontrolled expansion of a project’s scope without proper approval, often leading to delays, cost overruns, and resource strain. It happens when new features, tasks, or requirements are added after the project has already started, without adjusting the budget, timeline, or resources accordingly. Scope creep is a common problem in project management and usually results from poor requirement gathering, lack of stakeholder agreement, weak change control processes, or excessive client demands. Managing scope creep requires strict project governance, a well-defined scope statement, and a formal change control process to evaluate, approve, or reject changes systematically."
    },
    {
        "term":"Project Charter",
        "description":"A Project Charter is a formal document that authorizes the existence of a project and gives the project manager the authority to apply resources to project activities. It is issued by a project sponsor or a senior stakeholder and acts as the foundation for project planning. The charter provides a high-level overview of the project, including objectives, scope, stakeholders, risks, assumptions, and initial budget estimates.\n \nThe project charter is important because it formally ties the project to organizational goals and ensures that the project team understands why the project exists and what success looks like. It also defines who is responsible for decision-making and acts as a reference document if conflicts arise later."
    },
    {
        "term":"Work Breakdown Structure (WBS)",
        "description":"A Work Breakdown Structure (WBS) is a visual, hierarchical breakdown of all the work required to complete a project. It divides the project into smaller, manageable components called work packages. Each work package represents a specific deliverable or chunk of work, making it easier to assign responsibilities, estimate costs, and track progress.\n \nThe WBS follows a parent-child structure, starting from the final project deliverable at the top, which is then broken down into major deliverables, which are further decomposed into smaller tasks. This breakdown continues until each task is small enough to be assigned, tracked, and completed independently. A properly constructed WBS helps teams understand the full scope of work required, ensuring nothing is overlooked.\n \nThe WBS is a cornerstone of project planning, directly feeding into schedules, budgets, risk plans, and resource allocation."
    },
    {
        "term":"Milestone",
        "description":"A milestone is a significant event or checkpoint within a project that marks the completion of a key phase or deliverable. Unlike regular tasks, milestones are zero-duration events, meaning they don’t represent work itself, but rather the achievement of something important — like finishing design, gaining client approval, or completing a critical test phase.\n \n Milestones help track project progress at a higher level and are often used in status reporting to senior management. They provide clear visibility into whether the project is on schedule, and they serve as decision points — where stakeholders review progress and authorize moving to the next phase.\n \n Milestones are especially important in waterfall projects, where work progresses sequentially and each phase relies on the successful completion of the previous one."
    },
    {
        "term":"Deliverable",
        "description":"A deliverable is any tangible or intangible output that is produced as part of a project and handed over to the customer, stakeholder, or end-user. Deliverables can be documents, products, services, reports, software, or any completed work that meets project requirements.\n \n Deliverables are classified into two types:\n \n Internal Deliverables – Outputs produced for the project team or organization, such as project plans, status reports, or test results.\n External Deliverables – Outputs meant for clients, customers, or end-users, such as a website, a mobile app, or a new machine prototype.\n A deliverable must be measurable, verifiable, and accepted by stakeholders. It is often linked to project milestones, ensuring that work is completed in phases."
    },
    {
        "term":"Stakeholder",
        "description":"A stakeholder is any individual, group, or organization that can affect, be affected by, or perceive themselves as affected by the project’s outcome. Stakeholders can be internal (within the organization) or external (customers, regulators, suppliers). They play a critical role because they have expectations, influence, and power that can impact project success.\n \n Identifying who your stakeholders are and understanding their level of interest, power, and influence helps project managers develop effective communication plans and engagement strategies. Projects rarely succeed without proper stakeholder management, as unmet stakeholder expectations can derail even technically successful projects.\n \n Stakeholder needs are often conflicting, meaning the project manager must balance priorities and negotiate trade-offs to keep everyone aligned. Proactive engagement is essential to avoid stakeholder resistance later in the project lifecycle."
    },
    {
        "term":"Risk",
        "description":"A risk in project management refers to any uncertain event or condition that, if it occurs, could have a positive or negative impact on one or more project objectives, such as scope, schedule, cost, or quality. Risks are inherent to all projects because projects, by definition, involve uncertainty and change.\n \n Risks can be threats (potential negative outcomes) or opportunities (potential positive outcomes). Effective risk management helps identify, assess, and plan responses to these risks so the project team can either reduce threats or capitalize on opportunities. Risks must be continuously monitored and reassessed throughout the project lifecycle.\n \n Risks are typically categorized into areas like technical risks, schedule risks, financial risks, operational risks, and external risks (such as regulatory or environmental factors). Each risk is assigned a probability (likelihood) and impact (severity) to prioritize which ones require the most attention."
    },
    {
        "term":"Risk Management Plan",
        "description":"A Risk Management Plan is a formal document that outlines how risks will be identified, analyzed, responded to, and monitored throughout the project lifecycle. It defines the processes, tools, roles, and responsibilities for managing project risks, ensuring that the project team has a proactive approach to handling uncertainty.\n \n This plan provides a structured framework for continuously assessing risks as the project progresses. It also establishes a risk tolerance threshold, meaning it defines what levels of risk are acceptable to the organization and when escalation to leadership is required. The Risk Management Plan is a critical part of the overall project management plan and directly supports project success by helping the team anticipate problems and opportunities rather than simply reacting to them."
    },
    {
        "term":"Issue",
        "description":"An issue is a current problem or obstacle that has already occurred and is actively affecting the project’s progress. Unlike risks (which are potential problems that may occur in the future), issues are real, present challenges that need immediate attention and resolution to avoid project delays, increased costs, or quality compromises.\n \n Issues can arise from unforeseen risks that materialize or from poor planning, resource conflicts, stakeholder disagreements, technology failures, regulatory changes, and many other factors. Each issue should be documented in an Issue Log, which tracks the nature of the issue, its impact, who owns its resolution, actions taken, and current status.\n \n Managing issues quickly and effectively is critical because unresolved issues compound over time and may escalate into project-threatening problems. Effective issue management requires good communication, rapid decision-making, and a clear escalation process when needed."
    },
    {
        "term":"Assumption",
        "description":"In project management, an assumption is a factor or condition that is believed to be true for project planning purposes, even though it cannot be fully verified at the time. Assumptions are made to allow planning to move forward despite uncertainties. They are documented because, if they turn out to be false, the project may need to replan, change direction, or absorb additional risks.\n \n Assumptions typically relate to resource availability, technology performance, supplier reliability, or external conditions like regulatory environments. Every assumption carries some level of risk — if reality doesn’t match the assumption, the project plan, budget, timeline, or scope could be seriously impacted. To manage this, assumptions are tracked in an Assumptions Log and periodically reviewed.\n \n Assumptions should be as specific and realistic as possible, and the project team should identify risks directly tied to assumptions not holding true. Assumptions are a normal part of all projects, especially those in new or evolving environments where data is incomplete."
    },
    {
        "term":"Constraint",
        "description":"A constraint in project management is any limitation, restriction, or boundary that the project must work within. Constraints are non-negotiable factors that shape the project scope, schedule, cost, resources, or quality. They act as fixed conditions that restrict project flexibility and force the team to make trade-offs when managing the project.\n \n There are many types of constraints — the most common being time, cost, and scope, often referred to as the triple constraint or iron triangle. However, constraints can also include technology limitations, regulatory requirements, resource shortages, or environmental factors. Successful project managers identify constraints early and ensure they are clearly documented and communicated to all stakeholders.\n \n Constraints are external realities the project must adapt to — they are not the same as risks (which are uncertain events) or assumptions (which are believed to be true). Constraints are usually well known at project initiation, and failure to work within them can cause non-compliance, budget overruns, or missed deadlines."
    },
    {
        "term":"Project Sponsor",
        "description":"The Project Sponsor is a senior executive or high-level stakeholder who owns the project at the organizational level. They provide strategic direction, secure funding, and act as the champion of the project within the organization. The sponsor has the authority to approve major decisions, resolve escalated issues, and remove political or organizational roadblocks.\n \n The sponsor is not involved in day-to-day execution, but they ensure alignment between the project and business goals. Their primary role is to support the project manager by removing obstacles that the team cannot address themselves — such as securing resources, resolving conflicts between departments, or approving significant changes to scope, schedule, or budget.\n \n A strong and engaged sponsor can greatly increase the chances of project success, as they help maintain executive visibility and senior stakeholder support throughout the lifecycle."
    },
    {
        "term":"Project manager",
        "description":"A Project Manager (PM) is the person responsible for the overall planning, execution, monitoring, control, and closure of the project. They ensure the project meets its scope, time, cost, and quality objectives while managing risks, communication, stakeholders, and team performance. The PM acts as the central point of coordination across all project activities.\n \n Unlike the project sponsor, who focuses on the strategic business case and securing funding, the project manager focuses on the day-to-day operational work required to keep the project moving forward. The PM balances competing demands—like limited time, constrained budget, shifting scope, and stakeholder expectations—to deliver a successful project outcome.\n \n A good project manager must have technical project management skills, strong leadership qualities, and excellent communication abilities, as they work with diverse teams, handle conflicts, and regularly report to both stakeholders and team members."
    },
    {
        "term":"Project Team",
        "description":"A Project Team refers to the group of individuals assigned to work on a project, each contributing their specific expertise and skills to complete project tasks and deliverables. The team includes both core and extended members—from developers and analysts to testers, designers, and subject matter experts (SMEs)—depending on the project’s requirements.\n \n The project manager leads the team, ensuring that everyone understands their roles, stays on schedule, and collaborates effectively. Team members may come from different departments (matrix organization), work exclusively on the project (dedicated team), or split time between projects (part-time resources). In Agile projects, the team is often self-organizing, with less top-down control.\n \n A project team’s performance directly affects project success, meaning the project manager must focus not just on assigning tasks, but also on team dynamics, motivation, conflict resolution, and continuous communication."
    },
    {
        "term":"Project Lifecycle",
        "description":"A Project Lifecycle refers to the series of phases a project passes through from start to finish. It provides a structured framework for managing projects, ensuring all essential activities—planning, execution, monitoring, and closure—are completed in the correct sequence. Every project, regardless of size or type, follows some form of lifecycle.\n \n A typical project lifecycle includes five phases:\n \n Initiation – Defining the project at a high level and getting formal approval to proceed.\n Planning – Developing detailed plans for scope, schedule, cost, risk, quality, and communication.\n Execution – Doing the actual work to create deliverables.\n Monitoring & Controlling – Tracking performance and ensuring the project stays on track.\n Closure – Formally completing and closing the project, including lessons learned and final reports.\n The lifecycle helps stakeholders understand where the project stands and what’s coming next. Different methodologies (Waterfall, Agile) customize the lifecycle, but the core concept—moving through clear phases—remains constant."
    },
    {
        "term":"Gantt Chart",
        "description":"A Gantt Chart is a visual project scheduling tool that displays tasks, their durations, dependencies, and start\/end dates on a horizontal timeline. Each task is represented as a bar, showing when the task starts, how long it will take, and when it finishes. Gantt charts provide a clear view of the project schedule in one place.\n \n This chart is especially useful for tracking progress, identifying task overlaps or conflicts, and understanding which tasks depend on others (dependencies). Modern project management software (like Microsoft Project, Smartsheet, or Monday.com) allows teams to create interactive Gantt charts where updates to tasks automatically shift dependent tasks.\n \n Gantt charts are ideal for predictive (waterfall) projects, but they can also help in Agile projects when teams want to visualize timelines at a high level (release plans). However, in highly adaptive projects, Gantt charts may be less useful compared to backlogs and Kanban boards."
    },
    {
        "term":"Ciritcal Path Method (CPM)",
        "description":"The Critical Path Method (CPM) is a project scheduling technique used to identify the longest sequence of dependent tasks required to complete a project. The critical path represents the shortest possible time to complete the project. If any task on the critical path is delayed, the entire project’s end date is also delayed.\n \n CPM helps project managers prioritize work, as tasks on the critical path have zero float (meaning there’s no flexibility in their timing). This method is especially useful for complex projects with many interdependent tasks. Tasks not on the critical path may have float (or slack)—allowing slight delays without impacting the overall schedule.\n \n Critical Path analysis is often paired with Gantt charts to visually represent task sequences, helping teams understand which activities are critical versus which ones have flexibility. It’s an essential technique for projects with tight deadlines, like construction, software development, or product launches."
    },
    {
        "term":"Earned Value Management (EVM)",
        "description":"Earned Value Management (EVM) is a quantitative project performance measurement technique that helps project managers track progress by comparing planned work, actual work completed, and actual costs incurred. It allows teams to understand if the project is on schedule and within budget, while also forecasting how the project will perform if trends continue.\n \n EVM integrates scope, schedule, and cost into one cohesive framework. Instead of just asking “How much work have we done?” it asks, “How much value should we have earned by now based on the plan, and at what cost?” This method provides early warning signals if things are off track, giving project managers the chance to correct course before it’s too late.\n \n By calculating metrics like Schedule Variance (SV) and Cost Variance (CV), project managers can quantify exactly how much ahead or behind schedule the project is, and whether they are under or over budget. This makes EVM a powerful performance management tool, particularly for large, complex projects."
    },
    {
        "term":"Baseline",
        "description":"A Baseline in project management is the original, approved version of key project documents such as the scope, schedule, and budget. It serves as a reference point to measure actual project performance against the original plan. Once a project starts, any changes to the baseline require formal change control approval.\n \n The baseline essentially acts like a frozen snapshot of the project’s approved plan — capturing what work should be done, when it should be completed, and at what cost. Throughout the project, the team compares actual progress, costs, and scope to this baseline to determine if the project is on track or drifting off course.\n \n A project typically has three primary baselines:\n \n Scope Baseline - Defines what work is included.\n Schedule Baseline - Defines the approved timeline.\n Cost Baseline - Defines the approved budget.\n If a project’s performance deviates too far from the baseline, it signals trouble—requiring corrective action or an approved change request to update the baseline."
    },
    {
        "term":"Change Management",
        "description":"Change Management in project management refers to the formal process of identifying, evaluating, approving, and implementing changes to a project’s scope, schedule, cost, or quality. Every project operates within a baseline plan, and any modification—whether adding new features, extending deadlines, or adjusting budgets—requires a structured process to assess its impact and feasibility.\n \n Without effective change management, projects risk scope creep, uncontrolled costs, and missed deadlines because changes can disrupt carefully planned work. Change requests are usually documented, reviewed by stakeholders, evaluated for impact, and either approved or rejected through a formal process called the Change Control Process.\n \n Change management helps balance flexibility with control, ensuring that valuable changes are accommodated while protecting the project’s core objectives. It also ensures that every stakeholder is aligned on changes, and the project team can adjust plans appropriately."
    },
    {
        "term":"Communication Plan",
        "description":"A Communication Plan is a formal document that defines how, when, and to whom project information will be communicated throughout the project lifecycle. Effective communication is critical for project success, as stakeholders need to be regularly informed about progress, risks, issues, and key decisions. A well-crafted communication plan ensures that the right information reaches the right people at the right time.\n \n The plan outlines who the key stakeholders are, what types of information they need, the frequency and method of communication (such as meetings, emails, dashboards), and who is responsible for delivering the communication. It also covers communication tools and protocols, ensuring everyone knows where to find important project updates.\n \n The purpose of the communication plan is to align expectations, improve transparency, build trust, and avoid misunderstandings. By proactively planning communication, the project manager ensures all parties stay engaged, reducing the risk of surprises and misaligned goals."
    },
    {
        "term":"Cost Management",
        "description":"Cost Management is the process of planning, estimating, budgeting, financing, funding, managing, and controlling costs so that the project can be completed within the approved budget. It ensures that project expenditures are tracked and controlled throughout the project lifecycle, aligning with the financial goals of the project and the organization.\n \n Effective cost management starts during project planning, where the project manager works with finance teams and subject matter experts to create a realistic cost estimate. This estimate becomes the cost baseline, which is monitored and compared against actual costs during project execution. If unexpected expenses arise, change management and cost controls are triggered to evaluate the impact and necessary actions.\n \n Cost management is critical for maintaining project profitability, avoiding overruns, and ensuring the business case remains valid. It often uses Earned Value Management (EVM) and other performance tracking techniques to assess how well the project is sticking to its financial plan."
    },
    {
        "term":"Resource Allocation",
        "description":"Resource Allocation is the process of assigning the necessary resources—such as team members, equipment, budget, or materials—to specific tasks within a project. It ensures that each task has the right resources at the right time, helping the project run smoothly and efficiently.\n \n Effective resource allocation requires understanding the skills, availability, and workload of team members, as well as ensuring that equipment or tools needed for a task are available when required. If done poorly, projects face bottlenecks, delays, and overworked teams, ultimately affecting quality and morale.\n \n Resource allocation also takes place across multiple projects when working in matrix organizations—this means the same people or assets might be shared across different projects. This makes conflict management and prioritization essential in these environments."
    },
    {
        "term":"Project Schedule",
        "description":"A Project Schedule is a comprehensive timeline that defines when each activity, task, and milestone will start and end. It is one of the most critical project management tools, providing a roadmap to project completion. A well-made schedule helps project managers track progress, forecast delays, and reschedule work when required.\n \n The project schedule is based on estimated task durations, dependencies between tasks, and resource availability. It includes both sequential and parallel tasks, identifies the critical path (the longest chain of dependent tasks that defines project duration), and highlights key milestones."
    },
    {
        "term":"RACI Matrix",
        "description":"A RACI Matrix (also known as a Responsibility Assignment Matrix) is a simple yet powerful tool used in project management to clarify roles and responsibilities for each task, deliverable, or process within a project. It helps avoid confusion about who does what and ensures every stakeholder understands their role.\n \n The RACI matrix maps each task or deliverable to one or more of these roles:\n \n R = Responsible (The person who actually does the work to complete the task.)\n A = Accountable (The person ultimately answerable for ensuring the task is completed correctly and on time. Only one person can be accountable for each task.)\n C = Consulted (People whose input is needed before the task can be completed. They provide expertise or feedback.)\n I = Informed (People who need to be kept up to date about the task’s progress but don’t contribute directly.)\n This tool is especially useful in cross-functional projects where multiple departments are involved, and the lines of responsibility could easily blur. By using a RACI matrix, the project manager reduces confusion, improves collaboration, and avoids critical tasks falling through the cracks."
    },
    {
        "term":"KPI (Key Performance Indicator)",
        "description":"KPIs are quantifiable measures that help assess how well a project is performing against its goals. Unlike general metrics, KPIs are strategic indicators directly tied to the project’s success criteria. They help teams and stakeholders gauge if the project is on track, at risk, or needs corrective action.\n \n KPIs should always follow the SMART rule—Specific, Measurable, Achievable, Relevant, and Time-bound. Common project KPIs include on-time delivery rate, cost variance, defect rates, stakeholder satisfaction, and earned value performance indices (SPI and CPI)."
    },
    {
        "term":"Agile",
        "description":"Agile is a flexible, iterative approach to project management that prioritizes customer collaboration, responsiveness to change, and incremental delivery. Instead of delivering everything at the end, Agile teams deliver working product increments frequently (every 1-4 weeks). Agile is ideal for projects with changing or unclear requirements.\n \n Agile is based on the Agile Manifesto, which emphasizes:\n \n Individuals and interactions over processes and tools.\n Working software over comprehensive documentation.\n Customer collaboration over contract negotiation.\n Responding to change over following a plan.\n Agile includes frameworks like Scrum, Kanban, and Extreme Programming (XP)."
    },
    {
        "term":"Waterfall",
        "description":"Waterfall is a linear, sequential project management method where the project flows through distinct phases (Requirements → Design → Development → Testing → Deployment). Each phase must be fully completed before moving to the next.\n \n It’s ideal for projects where:\n \n Requirements are well-defined upfront.\n Changes are unlikely.\n The deliverable is well-understood."
    },
    {
        "term":"Scrum",
        "description":"Scrum is a specific Agile framework with defined:\n Roles: Product Owner, Scrum Master, Development Team.\n Events: Sprint Planning, Daily Scrum, Sprint Review, Sprint Retrospective.\n Artifacts: Product Backlog, Sprint Backlog, Increment.\n Work is completed in time-boxed sprints (1-4 weeks), and teams self-organize to achieve the sprint goal."
    },
    {
        "term":"Sprint",
        "description":"A Sprint is a fixed, time-boxed period (usually 1 to 4 weeks) during which an Agile team works to complete a defined set of deliverables from the product backlog. Sprints are at the heart of Scrum methodology, helping teams break down large projects into smaller, manageable increments that can be delivered frequently.\n \n Each sprint starts with a Sprint Planning Meeting, where the team selects high-priority items from the backlog and commits to delivering them by the end of the sprint. Once the sprint starts, the goal is frozen (no new work is added mid-sprint), helping the team stay focused.\n \n At the end of each sprint, the team holds a Sprint Review to demonstrate the completed work to stakeholders and a Sprint Retrospective to reflect on what went well and what could improve in future sprints."
    },
    {
        "term":"Product Backlog",
        "description":"The Product Backlog is a prioritized list of all work items, features, fixes, and improvements that need to be completed to deliver a successful product. It is managed by the Product Owner and serves as the single source of truth for everything the team will work on.\n \n Backlog items can range from:\n \n New features.\n Technical enhancements.\n Bug fixes.\n Documentation or compliance requirements.\n Each item in the backlog includes:\n \n A description.\n Acceptance criteria (what “done” looks like).\n Priority (business value or urgency).\n Estimates (time\/effort).\n The backlog is refined regularly (Backlog Grooming\/Refinement) to ensure items are ready for upcoming sprints."
    },
    {
        "term":"Stand-up Meeting",
        "description":"A Stand-up Meeting (also called Daily Scrum) is a short, daily team meeting (typically 15 minutes) held to align the team on progress and obstacles. The purpose is to increase transparency, enhance collaboration, and quickly address blockers.\n \n During the stand-up, each team member answers:\n \n What did I work on yesterday?\n What will I work on today?\n Are there any blockers preventing my progress?\n Stand-ups are usually held at the same time and place every day, and they are meant to be brief and focused—standing up helps enforce this brevity."
    },
    {
        "term":"Lessons Learned",
        "description":"Lessons Learned refers to the documented experiences, insights, successes, and challenges gathered during a project. These lessons help future projects by highlighting what worked well (best practices) and what went wrong (pitfalls to avoid). Capturing lessons learned ensures continuous improvement within an organization’s project management practices.\n \n Lessons learned are typically gathered during the project closure phase, but they can also be captured during key milestones if the project is large. This feedback is critical for improving processes, team collaboration, risk management, and stakeholder communication in future projects. The goal is to build organizational knowledge, not just individual experience.\n \n A well-documented lessons learned repository becomes a valuable asset for project managers and teams, allowing them to avoid repeating mistakes and build on proven successes in future projects. These lessons often touch on planning gaps, communication breakdowns, scope changes, quality issues, and successful risk responses."
    },
    {
        "term":"Procurement Management",
        "description":"Procurement Management is the process of acquiring goods, services, or resources from external vendors or suppliers to support project delivery. In many projects, not all work can be done internally — equipment, expertise, materials, or specialized services need to be purchased or contracted from third parties.\n \n Procurement management covers the entire procurement lifecycle:\n \n Planning Procurement – Defining what the project needs to purchase, when, and from whom.\n Conducting Procurement – Soliciting bids, selecting vendors, and awarding contracts.\n Managing Procurement – Overseeing vendor performance, resolving disputes, and ensuring delivery meets contractual requirements.\n Closing Procurement – Ensuring all obligations are met before formally closing vendor contracts.\n This process protects the project from risks such as vendor non-performance, cost overruns, and quality issues. Effective procurement management ensures vendors are selected fairly, contracts are clearly defined, and deliverables meet quality expectations."
    },
    {
        "term":"Quality Assurance (QA)",
        "description":"Quality Assurance (QA) is the proactive process of preventing defects by ensuring correct processes and standards are followed throughout the project. It focuses on the process quality—how work is performed to ensure high-quality deliverables.\n \n QA involves:\n \n Defining quality standards at the start of the project.\n Conducting process audits and reviews.\n Providing training and guidelines for quality compliance.\n Ensuring teams follow agreed processes correctly and consistently.\n QA is about prevention, not inspection—ensuring work is done right the first time."
    },
    {
        "term":"Quality Control (QC)",
        "description":"Quality Control (QC) is the reactive process of inspecting deliverables to ensure they meet defined quality standards and requirements. While QA focuses on the process, QC focuses on the end product—checking for defects after work is completed.\n \n QC activities include:\n \n Product inspections.\n Testing and validation.\n Defect tracking and corrective actions.\n Performance testing (for software or processes).\n QC ensures the final product meets expectations, but it’s a last line of defense—not a substitute for good QA."
    },
    {
        "term":"Project Governance",
        "description":"Project Governance refers to the framework of rules, processes, roles, and responsibilities that defines how a project is directed, controlled, and overseen. It ensures the project aligns with organizational goals, complies with policies and regulations, and delivers value to stakeholders while following best practices in project management.\n \n Governance establishes who has authority to make decisions, how issues are escalated, how changes are approved, and how project performance is monitored and reported. It links project work to strategic business objectives and ensures that the project team, sponsor, and stakeholders are aligned throughout the project lifecycle.\n \n Effective governance provides checks and balances, ensuring the project manager has the right level of authority while accountability and oversight are maintained by senior management, such as a Steering Committee or Project Management Office (PMO)."
    },
    {
        "term":"Triple Constraint (Iron Triangle)",
        "description":"The Triple Constraint, also known as the Iron Triangle, is a core concept in project management that highlights the three critical factors that constrain every project: Scope, Time, and Cost. These three elements are interdependent, meaning changing one impacts the others. Successfully managing a project requires balancing these constraints to meet stakeholder expectations.\n \n The idea is simple: you can’t change one side of the triangle without affecting at least one of the others. For example, if you expand the project scope, you will likely need more time or more budget. If you reduce the time available, you may need to reduce scope or increase budget (e.g., hiring extra resources).\n \n The Triple Constraint forces project managers to make trade-offs when project conditions change. This framework helps explain to stakeholders why unplanned changes impact the entire project, reinforcing the need for clear scope definition and rigorous change control."
    },
    {
        "term":"Burn-Down Chart",
        "description":"A Burn-Down Chart is a visual tool used in Agile projects to show how much work remains versus time left in a sprint or project. It helps the team and stakeholders see whether they are on track to complete the planned work.\n \n The y-axis shows the remaining work (usually in story points or hours), and the x-axis shows time (days in a sprint, or weeks in a release). Ideally, the line trends downward to zero by the end of the period."
    },
    {
        "term":"Resource Leveling",
        "description":"Resource Leveling is a technique used to adjust the project schedule to balance resource demand and supply. When multiple tasks require the same resource simultaneously or if a resource is overallocated (assigned more work than they can complete in a given time), the project manager reschedules or reassigns work to remove the overload.\n \n The goal of resource leveling is to ensure that workloads are manageable and resources are used efficiently without burnout. It also prevents bottlenecks caused by critical resources being unavailable when needed. However, this often leads to extending the project schedule—hence, resource leveling is a trade-off between resource efficiency and schedule adherence."
    },
    {
        "term":"Stakeholder Analysis",
        "description":"Stakeholder Analysis is the process of identifying project stakeholders, assessing their level of interest, influence, and potential impact on the project, and determining how to engage and manage them effectively. This analysis helps project managers understand who supports, who opposes, and who needs to be closely managed during the project lifecycle.\n \n Stakeholders are anyone who can affect, or be affected by, the project—ranging from senior executives, customers, end users, to external regulators. By mapping stakeholders, the project manager can tailor communication strategies, anticipate resistance, and build strong alliances to ensure project success.\n \n Stakeholder analysis is typically documented using a Stakeholder Register and a Power-Interest Grid, which visually maps each stakeholder based on their influence (power) and interest (how much they care about the project’s outcome). This analysis is revisited regularly as new stakeholders emerge or stakeholder opinions shift."
    },
    {
        "term":"Requirements Management",
        "description":"Requirements Management is the structured process of gathering, documenting, analyzing, prioritizing, tracing, and controlling project requirements to ensure the final deliverables meet stakeholder expectations.\n \n This starts with requirement collection—working closely with stakeholders to understand their needs. Requirements are then documented clearly and unambiguously in a Requirements Document or a Product Backlog (in Agile). They are classified into:\n \n Functional Requirements (What the system must do).\n Non-Functional Requirements (Performance, security, compliance).\n Business Requirements (Overall business goals).\n Throughout the project, requirements are tracked (traceability matrix) and controlled to avoid unauthorized changes (scope creep)."
    },
    {
        "term":"Cost Variance (CV)",
        "description":"Cost Variance (CV) measures the difference between the value of work performed (Earned Value) and the actual cost incurred for that work. It answers the question: Are we over or under budget?\n Formula\n CV = Earned Value (EV) - Actual Cost (AC)\n \n CV > 0 = Under budget.\n CV < 0 = Over budget."
    },
    {
        "term":"Schedule Variance (SV)",
        "description":"Schedule Variance (SV) measures how much work has been completed vs. how much should have been completed by a given point. It highlights whether the project is ahead or behind schedule.\n Formula\n SV = Earned Value (EV) - Planned Value (PV)\n \n SV > 0 = Ahead of schedule.\n SV < 0 = Behind schedule."
    },
    {
        "term":"Project Closure",
        "description":"Project Closure is the final phase of the project lifecycle where the project is formally completed, reviewed, and closed. It’s not just about finishing the work — it’s about ensuring all deliverables meet acceptance criteria, handing over the final product to the client or operations team, and documenting lessons learned for future projects.\n \n Closure is critical because it provides a chance to evaluate the project’s success against the original scope, timeline, and budget. It also ensures that any loose ends (like final payments, documentation, and resource releases) are properly handled. Formal closure prevents the project from dragging on indefinitely.\n \n This phase typically includes a final project report, stakeholder sign-offs, archiving project documents, and holding a lessons learned meeting. It’s also a time to recognize team achievements and celebrate success."
    },
    {
        "term":"PMO (Project Management Office)",
        "description":"A PMO (Project Management Office) is a central organizational unit that defines, standardizes, supports, and governs project management practices across the organization. The PMO acts as a bridge between strategy and execution, ensuring all projects align with organizational goals.\n \n The PMO can play different roles:\n \n Supportive PMO (provides templates, guidance, and best practices).\n Controlling PMO (ensures compliance with organizational standards).\n Directive PMO (actively manages and directs projects).\n PMOs often maintain:\n \n Standard processes and tools.\n Central repository of project documentation.\n Portfolio dashboards to track all ongoing projects.\n Lessons learned library to promote continuous improvement."
    },
    {
        "term":"Project Kickoff Meeting",
        "description":"A Project Kickoff Meeting is the first official meeting where the project team, stakeholders, and sponsor come together to formally initiate the project. It serves to set expectations, align all participants, and ensure everyone understands the project’s goals, scope, timeline, roles, and communication process.\n \n This meeting helps the project manager build alignment and enthusiasm while clarifying how the team will work together. It’s not just about the tasks ahead, but also about setting the tone for collaboration, decision-making, and communication flow. The kickoff creates a shared understanding of success criteria and answers initial questions about risks, assumptions, and constraints.\n \n The agenda typically covers:\n \n Project background and business case.\n High-level scope, timeline, and budget.\n Team roles and responsibilities.\n Communication plan (meeting cadence, tools to use).\n High-level risks and issues.\n Expectations around escalation and decision-making.\n Open Q&A session."
    },
    {
        "term":"Project Status Report",
        "description":"A Project Status Report is a formal document or communication that provides a snapshot of the project’s current health, progress, and challenges at a specific point in time. It is typically shared on a regular basis (weekly, biweekly, or monthly) to inform stakeholders about how the project is performing against the plan.\n \n A good status report highlights what’s going well, what’s delayed, and any risks or issues requiring attention. It focuses on the core dimensions of project performance, such as:\n \n Scope progress (what deliverables are completed).\n Schedule status (on time, ahead, or behind).\n Budget status (under, over, or on track).\n Risks and issues (what new risks have emerged).\n Key upcoming milestones.\n Decisions needed (where input from leadership is required).\n The goal is to provide clear, actionable information so that stakeholders can support the project, make timely decisions, and avoid surprises."
    },
    {
        "term":"Stakeholder Management",
        "description":"Stakeholder Management is the process of identifying, analyzing, engaging, and influencing the individuals, groups, or organizations affected by or interested in a project. Successful stakeholder management ensures that expectations are aligned, concerns are addressed, and communication is effective throughout the project lifecycle.\n \n Stakeholders hold power, influence, or interest in the project’s outcome, which makes managing them critical to project success. Effective stakeholder management requires regular communication, understanding their needs, and involving them appropriately at each phase of the project. Projects with poor stakeholder management often suffer from miscommunication, resistance, scope creep, and reduced support.\n \n This process starts with Stakeholder Identification (finding all impacted parties), followed by Stakeholder Analysis (understanding their power, influence, and interest), and then developing a Stakeholder Engagement Plan (describing how and when to communicate with each stakeholder group)."
    },
    {
        "term":"Resource Management",
        "description":"Resource Management is the process of planning, allocating, managing, and optimizing the resources needed to complete a project successfully. These resources include people (human resources), equipment, materials, technology, and even budget. Effective resource management ensures that the right resources are available at the right time and in the right quantity.\n \n In projects, resources are limited—especially skilled personnel—so project managers must carefully balance resource availability against project needs. This involves assigning team members to tasks based on their skills, monitoring workload, avoiding resource overload, and adjusting plans as needed when conflicts arise (for example, if the same team member is needed on two projects at once).\n \n Good resource management reduces delays, avoids burnout, and helps control costs by making sure expensive resources (like specialized equipment or consultants) are used efficiently. It’s especially critical in matrix organizations, where teams work on multiple projects at the same time."
    },
    {
        "term":"Risk Register",
        "description":"A Risk Register is a documented log that records all identified risks in a project, along with their characteristics, analysis, and planned responses. It serves as a central repository where the project team tracks potential threats and opportunities, ensuring risks are visible, monitored, and actively managed throughout the project lifecycle.\n \n The register typically captures each risk’s description, its likelihood (probability), potential impact, the owner responsible for managing the risk, and planned response strategies. It is a living document, meaning it’s updated regularly as risks evolve, are mitigated, or new risks emerge.\n \n A well-maintained Risk Register helps project managers anticipate problems before they occur, ensuring proactive action instead of reactive firefighting. It also promotes transparent risk communication with stakeholders, improving confidence in the project’s risk management processes."
    },
    {
        "term":"Quality Management",
        "description":"Quality Management in project management refers to the process of ensuring that the project deliverables meet the required standards and satisfy stakeholder expectations. It is not just about final inspection — quality is built into the project from the start by defining standards, processes, and quality criteria during planning, and then monitoring and controlling quality throughout the project lifecycle.\n \n Quality management focuses on both product quality (the final deliverable) and process quality (the steps used to create the deliverable). A well-designed Quality Management Plan describes how quality requirements will be defined, measured, and controlled, ensuring that defects are caught early, rework is minimized, and the project outcome is fit for purpose.\n \n Quality management follows three primary processes:\n \n Quality Planning – Defining what quality means for this project and how to achieve it.\n Quality Assurance – Regular checks to ensure processes are being followed correctly.\n Quality Control – Inspecting actual deliverables to ensure they meet requirements."
    },
    {
        "term":"Risk Management",
        "description":"Risk Management is the structured process of identifying, analyzing, prioritizing, responding to, and monitoring project risks throughout the project lifecycle. Risks are uncertain events that, if they occur, could positively or negatively impact the project’s objectives, including scope, schedule, cost, quality, and resources.\n \n Effective risk management helps reduce the likelihood of negative risks (threats) and increase opportunities from positive risks. It’s a proactive approach that ensures the project team is prepared for uncertainty, rather than reacting after risks turn into problems. Risk management is an ongoing process, evolving as new risks emerge and existing risks change in probability and impact.\n \n A strong Risk Management Plan defines how risks will be identified, analyzed, documented, and managed. Each risk is typically logged in a Risk Register, which records details like its probability, impact, owner, and response strategy."
    },
    {
        "term":"Schedule Management",
        "description":"Schedule Management is the process of defining, planning, sequencing, estimating, developing, maintaining, and controlling the project schedule to ensure the project is completed on time. It helps the project team understand when each activity starts and finishes, how tasks depend on each other, and what the critical path is for the project.\n \n A well-managed schedule provides a realistic timeline that balances the scope of work, resource availability, and deadlines. It also serves as a baseline to track actual progress and identify delays early, allowing corrective actions to be taken. Schedule management isn’t a one-time activity — it’s a continuous process of updating, reforecasting, and communicating with stakeholders.\n \n A Schedule Management Plan is developed at the start of the project and describes how the schedule will be created, monitored, and adjusted if changes occur. It defines tools (like Gantt charts or scheduling software), performance metrics (like Schedule Variance and SPI), and responsibilities for maintaining the schedule."
    },
    {
        "term":"Scope Management",
        "description":"Scope Management is the process of defining, controlling, and ensuring that all the required work is completed — and only the required work — to successfully deliver a project. It ensures that the project stays focused on its approved goals and prevents scope creep, where unauthorized changes or extra work are added without proper evaluation and approval.\n \n Scope management defines both the Project Scope (what the project will deliver) and the Product Scope (features and functionality of the final deliverable). It starts with a clear scope statement, followed by creating a Work Breakdown Structure (WBS) that breaks the scope into manageable components. Scope management also includes regular verification (to confirm work is complete) and control (to prevent unauthorized changes).\n \n A Scope Management Plan documents how the scope will be defined, validated, and controlled, ensuring all stakeholders have a shared understanding of the boundaries of the project."
    },
    {
        "term":"Issue Log",
        "description":"An Issue Log is a living document that records all active problems, conflicts, or obstacles encountered during a project. Unlike risks (which are potential problems), issues are problems that have already happened and are affecting the project right now. The issue log helps project managers and teams track, manage, and resolve issues systematically.\n \n Each entry in the issue log typically includes:\n \n description of the issue.\n Date identified.\n Person responsible for resolving it.\n Priority level (High, Medium, Low).\n Status (Open, In Progress, Resolved).\n Any related action items or decisions needed to close the issue.\n The issue log is regularly reviewed in status meetings, ensuring that no critical problems are overlooked. It also becomes part of the final project documentation, providing valuable lessons learned for future projects."
    },
    {
        "term":"Project Scope Statement",
        "description":"A Project Scope Statement is a formal document that defines exactly what work is included in the project—and what is excluded. It is the foundation of scope management, providing clear boundaries so that everyone—from the project team to stakeholders—understands what will be delivered and what will not be delivered.\n \n The scope statement describes the project objectives, deliverables, requirements, constraints, assumptions, and any exclusions. It acts as a reference point throughout the project to control scope creep (unauthorized changes or additions to the project scope). A strong scope statement also supports budgeting, scheduling, risk management, and stakeholder communication.\n \n This document is created during the planning phase and typically requires approval from the project sponsor and key stakeholders before moving forward into execution."
    },
    {
        "term":"Assumptions Log",
        "description":"The Assumptions Log is a living document that records all the assumptions made during project planning, execution, and monitoring. Assumptions are factors or conditions that the project team believes to be true, even though they aren’t fully verified at the time. These assumptions often influence the schedule, cost, risk, and resource plans.\n \n The Assumptions Log also tracks constraints, which are limitations or boundaries the project must operate within—such as a fixed budget, regulatory requirements, or a hard deadline. Both assumptions and constraints are continuously monitored and updated as the project progresses.\n \n Documenting assumptions is critical because if an assumption proves false, it could significantly disrupt the project. By keeping a formal record, the project team can regularly review and validate assumptions, allowing them to adjust plans proactively when reality shifts."
    },
    {
        "term":"Project Dashboard",
        "description":"A Project Dashboard is a visual summary of the project’s current status, presented in a concise, at-a-glance format. It provides real-time data on key project metrics like progress, schedule, budget, risks, issues, and upcoming milestones. Dashboards are designed to give quick insights for project managers, sponsors, and stakeholders so they can understand the project’s health at a glance.\n \n A well-designed dashboard uses graphs, charts, and color coding (Green-Yellow-Red) to clearly indicate whether the project is on track, at risk, or in trouble. This makes dashboards an essential tool for status reporting, decision-making, and stakeholder communication.\n \n Modern project dashboards are often digital—integrated into project management software like Microsoft Project, Jira, Smartsheet, or Asana. They can be customized to show different views for different audiences, from detailed team-level dashboards to high-level executive summaries."
    },
    {
        "term":"Project Benefits Management",
        "description":"Project Benefits Management is the process of identifying, planning, tracking, and realizing the benefits a project is expected to deliver to the organization and its stakeholders. Benefits are the positive outcomes or value that justify the project’s investment—these could be financial gains, process improvements, customer satisfaction, compliance, or strategic advantage.\n \n Benefits management ensures that projects aren’t just about delivering outputs like products or systems, but also about achieving business outcomes—the actual improvements that those outputs enable. This process starts before the project begins (in the business case) and continues through project closure and even beyond, as some benefits are realized only after the project deliverables are in full use.\n \n The Benefits Management Plan is a key document, describing what benefits are expected, how they will be measured, and who is responsible for ensuring they are achieved. Benefits are often categorized into:\n \n Tangible benefits (e.g., cost savings of $100,000 per year).\n Intangible benefits (e.g., improved customer satisfaction or brand reputation)."
    },
    {
        "term":"Change Request",
        "description":"A Change Request is a formal proposal to modify any aspect of the project, including scope, schedule, cost, processes, or deliverables. Change requests can come from any stakeholder—customers, team members, vendors, or leadership. They often arise due to evolving business needs, technological changes, regulatory updates, or discovered defects.\n \n A change request process ensures that all changes are assessed for impact before they are approved or rejected. The project team evaluates how the change will affect:\n \n Scope: Does this expand or shrink what we have to deliver?\n Schedule: Will this add time to the timeline?\n Cost: Does it increase budget requirements?\n Quality: Will it affect performance, compliance, or user satisfaction?\n Risks: Does the change introduce new risks?\n Key Parts of a Change Request\n A proper change request includes:\n \n description: What needs to change and why.\n Justification: What’s driving the change (new regulation, defect fix, new opportunity).\n Impact Analysis: Impact on scope, schedule, cost, and risks.\n Alternatives: Is there a lower-impact option?\n Approval\/Decision: Accepted, rejected, deferred."
    },
    {
        "term":"Risk Apepetite",
        "description":"Risk Appetite refers to the amount and type of risk that an organization is willing to accept in pursuit of its strategic objectives. Every project introduces uncertainties, but how much uncertainty is acceptable depends on the organization’s culture, leadership mindset, industry regulations, and overall strategic goals.\n \n Some organizations, especially startups or tech innovators, may have a high risk appetite—willing to take on bold, uncertain projects for potential breakthrough gains. In contrast, regulated industries like healthcare or finance tend to have a low risk appetite, prioritizing stability, compliance, and reputation over aggressive innovation."
    },
    {
        "term":"Risk Mitigation",
        "description":"Risk Mitigation is the process of developing actions to reduce either the probability of a risk occurring or the impact if it does occur. It is one of the key strategies in risk response planning, especially for high or medium risks identified during project risk management.\n \n The goal of mitigation is to proactively address risks before they turn into actual issues, thereby reducing the threat to project objectives. This is different from risk acceptance (where you do nothing and simply tolerate the risk) or risk transfer (where you shift the risk to another party).\n \n Risk mitigation is usually documented in the Risk Register and reviewed regularly during project status meetings. For high-risk projects, it becomes part of the Risk Management Plan, ensuring the whole team knows how to respond if early warning signs appear."
    },
    {
        "term":"Risk Transfer",
        "description":"Risk Transfer is a risk response strategy where the project shifts the ownership or responsibility for managing a risk to a third party, usually through contracts, insurance, or outsourcing. While the risk itself does not disappear, its financial or operational consequences are transferred to someone better equipped to handle it.\n \n Risk transfer is especially useful for risks the project team cannot control directly, such as legal liability, equipment damage, or catastrophic failures. It’s most common in procurement management and contracting scenarios, where vendors, subcontractors, or insurers take on the risk in exchange for compensation."
    },
    {
        "term":"Contingency Reserve",
        "description":"A Contingency Reserve is a pre-approved amount of time, money, or resources set aside to cover known risks that may occur during the project. These are risks that have already been identified during risk planning, meaning they are foreseen but uncertain in terms of whether they will happen.\n \n Contingency reserves are part of the project budget or schedule baseline, but they are only used if a specific identified risk materializes. It’s essentially a buffer designed to keep the project on track without needing constant approvals when minor, expected risks occur."
    },
    {
        "term":"Management Reserve",
        "description":"Management Reserve is an extra amount of budget, time, or resources set aside to address unknown-unknowns—risks or issues that are unforeseen at the time of planning. These are different from contingency reserves, which cover known risks. Management reserves are held at the management level (typically by the project sponsor or senior leadership), not the project manager.\n \n This reserve acts as a safety net for extreme surprises—things no one could reasonably anticipate, such as:\n \n Sudden regulatory changes.\n New legal requirements.\n Major shifts in technology or policy.\n Disruption due to natural disasters, pandemics, or corporate restructuring."
    },
    {
        "term":"RAID Log",
        "description":"A RAID Log is a central document that tracks and manages four critical elements of a project:\n \n R = Risks – Potential future events that could impact project objectives.\n A = Assumptions – Things the team believes to be true for planning, but which may not be confirmed.\n I = Issues – Current problems that are actively affecting the project.\n D = Dependencies – External factors or deliverables that the project relies on.\n A RAID log serves as a living document, updated continuously from project initiation to closure. It helps project managers, sponsors, and teams stay aware of the project’s health, particularly around factors that could derail delivery if not actively monitored."
    },
    {
        "term":"Project Charter Approval",
        "description":"Project Charter Approval is the formal sign-off process where key stakeholders, typically the Project Sponsor or Steering Committee, officially authorize the project to begin. The approval of the charter means the organization formally commits resources, time, and funding to the project and gives the Project Manager authority to manage work and make decisions.\n \n Without an approved project charter, a project technically doesn’t exist in formal terms. It’s considered an idea or proposal, but not an authorized project. This step is the official \"green light\", allowing the project to move into detailed planning and execution."
    },
    {
        "term":"Issue Excalation",
        "description":"Issue Escalation is the formal process of raising unresolved project issues to a higher authority (such as the Project Sponsor, Steering Committee, or senior management) when the project team cannot resolve them within their level of authority. Escalation ensures that critical problems get visibility at the right level before they jeopardize the project’s success.\n \n Escalation is not just about complaining upwards—it’s a structured process, where the project manager provides:\n \n A clear description of the issue.\n Explanation of what has already been tried.\n Options and recommendations for resolution.\n Request for a specific decision or action."
    },
    {
        "term":"Project Dependencies",
        "description":"What are Project Dependencies?\n Project Dependencies are tasks, deliverables, or events that rely on the completion of other tasks, deliverables, or events before they can begin or proceed. In simple terms, a dependency means:\n \"Task B cannot start until Task A finishes.\"\n \n Dependencies can exist within the project (internal dependencies) or between projects (external dependencies). They are critical for accurate scheduling because missed dependencies often cause delays, rework, or resource conflicts.\n Type of Dependencies:\n Finish-to-Start (FS): Task B can’t start until Task A finishe\n Start-to-Start (SS): Task B starts at the same time as Task A.\n Finish-to-Finish (FF): Task B can’t finish until Task A finishes.\n Start-to-Finish (SF): Task B can’t finish until Task A starts."
    },
    {
        "term":"Critical Chain Method",
        "description":"The Critical Chain Method (CCM) is an advanced project scheduling technique that focuses not only on task dependencies (like the Critical Path Method) but also on resource availability. It recognizes that tasks do not exist in isolation—they depend heavily on the availability of people, equipment, or materials needed to complete them.\n \n Unlike traditional scheduling (which assumes resources are unlimited or fully available), CCM realistically accounts for resource constraints and builds buffers into the schedule to protect the overall project timeline from uncertainty and multitasking."
    },
    {
        "term":"Fast Tracking",
        "description":"Fast Tracking is a schedule compression technique where project activities that were originally planned to be done sequentially are overlapped and performed in parallel to shorten the overall project timeline. Fast tracking allows the project to finish sooner, but it also increases risk because teams work on partially completed inputs instead of waiting for everything to be finished properly.\n\nFast tracking is often used when a project is falling behind schedule or when external pressures (like a regulatory deadline or product launch date) require the timeline to be compressed.\n"
    },
    {
        "term":"Crashing",
        "description":"What is Crashing?\nCrashing is a schedule compression technique where additional resources (people, equipment, money) are applied to critical path tasks to accelerate their completion and shorten the project timeline. The goal is to reduce the duration of critical activities without changing the project scope.\n\nUnlike Fast Tracking, which overlaps tasks, crashing focuses on speeding up work already happening by increasing capacity (e.g., adding more people to a task or increasing work shifts). However, crashing almost always increases cost, because more resources are needed, often at a premium (overtime rates, expedited fees, etc.)."
    },
    {
        "term":"Deliverables Acceptance Criteria",
        "description":"Deliverables Acceptance Criteria are predefined, agreed-upon conditions that a project deliverable must meet before it is formally accepted by the customer, sponsor, or key stakeholders. These criteria define what \"done\" looks like and provide a clear, objective basis for evaluating whether the work product meets quality and contractual standards.\n\nAcceptance criteria are documented before work begins, usually in the Project Scope Statement, Requirements Documentation, or Contract. They ensure everyone has a shared understanding of the expectations for each deliverable, reducing confusion and conflict during handoff."
    },
    {
        "term":"Project Health Report",
        "description":"A Project Health Report is a high-level snapshot that provides an at-a-glance view of the project’s overall status and performance across key dimensions like scope, schedule, cost, risks, and issues. It’s usually color-coded (RAG status) to indicate whether the project is on track (Green), facing some challenges (Amber\/Yellow), or at serious risk of failure (Red).\n\nThe health report is a communication tool designed for: Executives and sponsors who want quick insights.\nProject Steering Committees who need to make decisions.\nPMOs who monitor multiple projects in a portfolio."
    },
    {
        "term":"Project Assumption Testing",
        "description":"What is Project Assumption Testing?\nProject Assumption Testing is the systematic process of identifying, validating, and continuously reviewing assumptions that the project is based on. Assumptions are things you believe to be true but have not yet confirmed—and many projects depend heavily on these assumptions.\n\nEvery project starts with some assumptions, such as:\n\nResource availability.\nVendor delivery timelines.\nMarket conditions remaining stable.\nTechnology being feasible.\nAssumption testing helps the team challenge these beliefs, so risky or unrealistic assumptions can be detected and managed before they cause serious project problems. It’s essentially a reality check on the project’s foundation.\n"
    },
    {
        "term":"Organizational Process Assests (OPA)",
        "description":"Organizational Process Assets (OPA) are all the internal processes, templates, knowledge bases, policies, historical data, and lessons learned that an organization uses to manage projects. These assets accumulate over time and become a valuable knowledge base that helps future projects avoid mistakes, follow proven processes, and leverage best practices.\n\nOPA acts as the institutional memory of the organization’s project management experiences. Every successful (or unsuccessful) project leaves behind documentation and artifacts, and these become part of the asset library that future project teams can access.\nKey Categories of OPA:-                                                                                                                                     Processes and Procedures: Project lifecycle processes, change control processes, procurement guidelines, communication protocols\nTemplates and Tools: Risk register templates, status report formats, project charter templates, stakeholder analysis matrices\nHistorical Information and Lessons Learned: Project closeout reports, post-mortem summaries, historical schedules and budgets, vendor performance reports\nKnowledge Repositories: Internal wikis, document management systems, PMO databases, project dashboards  "
    },
    {
        "term":"Enterprise Environmental Factors (EEF)",
        "description":"Enterprise Environmental Factors (EEF) are all the internal and external conditions, influences, and constraints that affect how a project is planned, executed, and managed. Unlike Organizational Process Assets (OPA), which are internal assets the organization controls, EEF includes factors the project team often has little or no control over.\n\nThese factors can be: Internal – Organizational culture, existing infrastructure, resource availability, policies.\nExternal – Government regulations, market conditions, economic climate, legal constraints.\n\nThe project manager must recognize and adapt to EEFs, because they shape the boundaries within which the project must operate. "
    },
    {
        "term":"Scope Validation",
        "description":"Scope Validation is the formal process of reviewing and accepting completed project deliverables to ensure they meet the agreed-upon requirements and scope. This process involves the customer, sponsor, or key stakeholders formally reviewing deliverables to confirm that they align with the approved project scope statement, requirements documentation, and acceptance criteria.\n\nScope validation is not about technical quality checks—that’s quality control. Instead, scope validation focuses on confirming that the right work was delivered and nothing important was missed."
    },
    {
        "term":"Project Closeout Report",
        "description":"A Project Closeout Report is a formal document that summarizes the entire project after its completion. It serves as the final record of what was delivered, how the project performed against its original objectives, and key lessons learned. This document is a critical part of project closure and becomes part of the Organizational Process Assets (OPA) for future reference.\n\nThe closeout report helps ensure that: All deliverables are completed and accepted.\nFinal performance is compared to the original scope, schedule, and budget.\nLessons learned are documented for future projects.\nAll contracts, resources, and accounts are formally closed.\nIt provides a formal sign-off, signaling the project is officially finished."
    },
    {
        "term":"Knowledge Transfer Plan",
        "description":"A Knowledge Transfer Plan is a structured document that outlines how critical knowledge, expertise, and information will be transferred from one person, team, or organization to another—usually during project handoffs, transitions, or team member exits. It ensures that valuable knowledge is not lost when project team members leave or the project is handed over to operations.\n\nKnowledge transfer is especially crucial during:\n\nProject closure, where the project team hands over the solution to support teams.\nTeam transitions, such as new team members joining mid-project.\nOutsourcing changes, where a new vendor takes over ongoing work.\nMergers or acquisitions, where knowledge must be preserved across merging entities."
    },
    {
        "term":"Cost Baseline",
        "description":"A Cost Baseline is the approved, time-phased budget for a project, which serves as a reference point to measure and control project cost performance. It shows how much money will be spent, when it will be spent, and for what purpose. The baseline is set after project planning is complete and becomes part of the Project Management Plan.\n\nThe cost baseline is used throughout the project to compare actual costs against planned costs and to assess whether the project is on budget, over budget, or under budget."
    },
    {
        "term":"Work Authorization System",
        "description":"A Work Authorization System is a formal process and set of procedures used to ensure that work on a project is performed at the right time, by the right people, and in the correct sequence. It serves as a control mechanism to ensure that only approved work starts, and that work aligns with the project’s scope, schedule, and budget.\n\nThis system acts like a gatekeeper that prevents unnecessary, unauthorized, or out-of-scope work from being performed—helping maintain scope, schedule, and cost control."
    },
    {
        "term":"Kanban Board",
        "description":"A Kanban Board is a visual tool used to manage workflow and track progress in a project or process. It displays work items as they move through different stages of completion, helping teams visualize, manage, and optimize their workflow.\n\nKanban originated from Toyota’s lean manufacturing system, but today it’s widely used in Agile project management, DevOps, service delivery teams, and more. The board acts as a real-time information hub, ensuring everyone knows what’s in progress, what’s done, and what’s pending."
    },
    {
        "term":"Definition of Done (DOD)",
        "description":"The Definition of Done (DoD) is a formal checklist of criteria that a deliverable (e.g., user story, feature, product increment) must meet to be considered complete. It defines the minimum quality standard that all work must adhere to before it can be accepted and marked as “done.”\n\nThe DoD ensures that all stakeholders (developers, testers, product owners, etc.) have a common understanding of what \"complete\" really means. This avoids misunderstandings, rework, and gaps between development and business expectations."
    },
    {
        "term":"Velocity",
        "description":"Velocity is a key performance metric used in Agile project management (especially in Scrum) to measure how much work a team completes in a single sprint. It is typically expressed in terms of story points, hours, or completed user stories per sprint.\n\nVelocity helps teams forecast how much work they can handle in future sprints, making it a vital tool for sprint planning, release planning, and performance tracking.\n"
    },
    {
        "term":"Restrospective",
        "description":"A Retrospective is a structured meeting held at the end of each sprint or project phase, where the team comes together to reflect on their work process and discuss what went well, what didn’t go well, and how they can improve. It’s a core practice in Agile methodologies, especially in Scrum, but can be used in any project type.\n\nThe goal of a retrospective is to continuously improve team performance by identifying and addressing process issues, enhancing collaboration, and ensuring that lessons learned are applied to future work.\n"
    },
    {
        "term":"Stakeholder Enagagement Plan",
        "description":"A Stakeholder Engagement Plan is a formal strategy document that outlines how the project team will identify, analyze, communicate with, and actively engage stakeholders throughout the project lifecycle. Its goal is to ensure stakeholders are informed, aligned, and supportive at the right times, reducing resistance and increasing project success.\n\nIt’s not just a communication plan; it’s a broader strategy to manage expectations, resolve concerns, build trust, and keep everyone involved appropriately.\n"
    },
    {
        "term":"Assumption Analysis",
        "description":"Assumption Analysis is the process of identifying, documenting, validating, and analyzing assumptions made during the project lifecycle. Assumptions are things that are believed to be true without concrete evidence at the time of planning. They fill knowledge gaps where facts are unavailable, helping to create initial estimates and plans.\n\nSince assumptions introduce uncertainty, Assumption Analysis helps evaluate how reliable each assumption is and what risks could arise if an assumption turns out to be incorrect.\n"
    },
    {
        "term":"Root Cause Analysis",
        "description":"Root Cause Analysis (RCA) is a systematic process used to identify the underlying cause(s) of a problem or issue in a project. Instead of only addressing symptoms (the visible problems), RCA aims to trace the problem back to its origin—the true root cause—so that the team can prevent it from happening again.\n\nRCA is a proactive problem-solving tool used across industries like project management, manufacturing, IT, healthcare, and more. In projects, it’s especially valuable when investigating:  Missed deadlines\nCost overruns\nQuality defects\nProcess failures\nCommunication breakdowns"
    },
    {
        "term":"Earned Value Metrics",
        "description":"Earned Value Metrics are a set of quantitative performance indicators used to measure and monitor project performance and progress in terms of scope, schedule, and cost. These metrics form the core of Earned Value Management (EVM), a highly respected technique in project management to track project health objectively.\n\nThey answer critical questions:\n\nAre we on schedule?\nAre we on budget?\nHow much work has been completed versus what we planned?\nHow efficiently are we using our resources?"
    },
    {
        "term":"Project Benefits Realization",
        "description":"Project Benefits Realization is the process of ensuring that the benefits a project was expected to deliver are actually achieved after the project is completed. It focuses on linking project outputs (deliverables) to business outcomes (measurable benefits) and ensuring that these outcomes are tracked, measured, and sustained.\n\nIn simple words:\nProjects deliver outputs (like software, processes, or systems).\nBut the real reason for the project is to achieve benefits (like reduced costs, increased revenue, better compliance).\nBenefits realization ensures that those benefits don’t get forgotten once the project ends.\n"
    },
    {
        "term":"Value Stream Mapping",
        "description":"Value Stream Mapping (VSM) is a visual tool used to analyze, map, and optimize the flow of materials, information, and activities required to deliver a product or service to customers. It helps identify value-added vs. non-value-added steps within a process and highlights waste, bottlenecks, and inefficiencies.\n\nValue Stream Mapping originated from Lean Manufacturing, but it is now widely used in project management, software development, service industries, healthcare, and IT processes. It provides a big-picture view of how value flows across a system—end-to-end.\n"
    },
    {
        "term":"Cost Performance Index (CPI)",
        "description":"The Cost Performance Index (CPI) is a critical Earned Value Management (EVM) metric that measures how efficiently the project is using its budget. It compares the value of work completed (Earned Value - EV) to the actual cost incurred (Actual Cost - AC) to complete that work.\n\nCPI tells you if the project is over budget, under budget, or exactly on budget.\nIt is calculated using the formula:\nCPI= AC\/EV"
    },
    {
        "term":"Schedule Performance Index (SPI)",
        "description":"The Schedule Performance Index (SPI) is a key metric in Earned Value Management (EVM) used to measure how efficiently a project team is using its time. It compares the value of work actually completed (Earned Value - EV) to the value of work that was planned to be completed by now (Planned Value - PV).\nThe formula for SPI is:\nSPI= PV\/EV\nThis gives you an objective indicator of whether the project is ahead of schedule, on track, or falling behind."
    },
    {
        "term":"Stakeholder Register",
        "description":"A Stakeholder Register is a living document that lists all project stakeholders along with key details about them, such as their role, influence, interest, communication preferences, and expectations. It is a core project management tool used to manage stakeholder relationships and engagement throughout the project lifecycle.\n\nIt’s typically created during project initiation and updated throughout the project as new stakeholders emerge or existing ones change roles.\n"
    },
    {
        "term":"Procurement Statement of Work (SOW)",
        "description":"The Procurement Statement of Work (SOW) is a formal document that defines exactly what products, services, or results a vendor or supplier is expected to deliver under a contract. It provides detailed scope and performance expectations to ensure both parties—the buyer and the seller—have a clear understanding of what is being procured.\n\nIn project management, the Procurement SOW is critical for ensuring vendor work aligns with project goals, quality expectations, and timelines."
    },
    {
        "term":"Change Control Board (CCB)",
        "description":"The Change Control Board (CCB) is a formal group of stakeholders responsible for reviewing, evaluating, approving, or rejecting change requests during the project lifecycle. The CCB acts as the project’s decision-making authority for any changes to scope, schedule, cost, or quality after the baseline has been approved.\n\nThe goal of the CCB is to ensure only necessary, valuable, and feasible changes are implemented, and to assess their impact on the overall project before making a decision."
    },
    {
        "term":"Communication Matrix",
        "description":"A Communication Matrix is a document that outlines how communication will flow within the project, specifying who needs what information, when they need it, how they will receive it, and who is responsible for delivering it. It acts as a roadmap for all project-related communication, ensuring everyone stays informed and aligned.\n\nThis tool is part of the Communication Management Plan, but it focuses more on the practical, tactical side of communication, making sure no one is left out, and no critical message gets missed.\n"
    },
    {
        "term":"Lessons Learned Register",
        "description":"The Lessons Learned Register is a document that captures the knowledge gained from the experience of executing a project. It records what went well, what went wrong, what could be improved, and key insights that could benefit future projects.\n\nIt is an evolving document that gets updated throughout the project lifecycle (not just at the end) and serves as a reference for continuous improvement across the organization.\n"
    },
    {
        "term":"Project Kickoff Agenda",
        "description":"The Project Kickoff Agenda is a structured outline of topics to be discussed during the formal project kickoff meeting. The kickoff meeting is the first official meeting between the project team, sponsor, and key stakeholders after the project has been formally approved. It aligns everyone on the project’s objectives, scope, roles, processes, and expectations.\n \n The agenda ensures the meeting stays focused, covers all critical points, and sets the tone for clear communication and collaboration from day one."
    },
    {
        "term":"Change Request Process",
        "description":"The Change Request Process is a formal, structured approach for requesting, reviewing, approving, and implementing changes to a project’s scope, schedule, cost, or any other baseline element. This process ensures that no uncontrolled or undocumented changes (also called scope creep) happen, while also giving the project team a clear way to adapt when necessary.\n \n Changes are inevitable in most projects, but they must be handled deliberately and transparently to maintain control and stakeholder confidence."
    },
    {
        "term":"Benefits Realization Plan",
        "description":"A Benefits Realization Plan is a structured document that defines how the expected benefits of a project will be identified, tracked, measured, and achieved after the project is completed. It connects the project’s outputs (deliverables) to the actual business outcomes the project was intended to achieve. In other words, it answers the critical question:\n \n “How will we make sure this project actually delivers the value we promised?”"
    },
    {
        "term":"Risk Breakdown Structure",
        "description":"A Risk Breakdown Structure (RBS) is a hierarchical representation of potential risks in a project, grouped by categories or sources. It provides a structured way to identify, classify, and analyze risks, helping the project team think comprehensively about what could go wrong.\n \n The RBS is similar in format to a Work Breakdown Structure (WBS), but instead of breaking down work packages, it breaks down risk categories into more specific risks. This helps ensure no major risk area is overlooked."
    }
]